#### Terraform Format and Style `failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation `success`
<details><summary>Validation Output</summary>
```

Success! The configuration is valid.


```
</details>
#### Terraform Plan `success`
<details><summary>Show Plan</summary>
```

terraform
data.google_iam_policy.auth: Reading...
google_project_service.enable_api["serviceusage.googleapis.com"]: Refreshing state... [id=mh-api-389212/serviceusage.googleapis.com]
google_project_service.enable_api["iam.googleapis.com"]: Refreshing state... [id=mh-api-389212/iam.googleapis.com]
google_project_service.enable_api["artifactregistry.googleapis.com"]: Refreshing state... [id=mh-api-389212/artifactregistry.googleapis.com]
google_project_service.enable_api["iamcredentials.googleapis.com"]: Refreshing state... [id=mh-api-389212/iamcredentials.googleapis.com]
google_project_iam_member.cloud_run_trace_agent: Refreshing state... [id=mh-api-389212/roles/cloudtrace.agent/serviceAccount:terraform@mh-api-389212.iam.gserviceaccount.com]
google_project_service.enable_api["run.googleapis.com"]: Refreshing state... [id=mh-api-389212/run.googleapis.com]
google_project_service.enable_api["logging.googleapis.com"]: Refreshing state... [id=mh-api-389212/logging.googleapis.com]
data.google_iam_policy.auth: Read complete after 0s [id=3450855414]
google_project_service.enable_api["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=mh-api-389212/cloudresourcemanager.googleapis.com]
google_cloud_run_service.stg-mh-mcp: Refreshing state... [id=locations/asia-northeast1/namespaces/mh-api-389212/services/stg-mh-mcp]
data.google_iam_policy.mcp_auth: Reading...
data.google_iam_policy.mcp_auth: Read complete after 0s [id=2054599854]
google_project_iam_member.logging_writer: Refreshing state... [id=mh-api-389212/roles/logging.logWriter/serviceAccount:terraform@mh-api-389212.iam.gserviceaccount.com]
google_project_iam_member.service_account_user: Refreshing state... [id=mh-api-389212/roles/iam.serviceAccountUser/serviceAccount:terraform@mh-api-389212.iam.gserviceaccount.com]
data.google_service_account.terraform_sa: Reading...
data.google_service_account.terraform_sa: Read complete after 0s [id=projects/mh-api-389212/serviceAccounts/terraform@mh-api-389212.iam.gserviceaccount.com]
google_cloud_run_service.stg-mh-api: Refreshing state... [id=locations/asia-northeast1/namespaces/mh-api-389212/services/stg-mh-api]
google_iam_workload_identity_pool.terraform-pool: Refreshing state... [id=projects/mh-api-389212/locations/global/workloadIdentityPools/terraform-pool]
google_service_account_iam_member.terraform_sa: Refreshing state... [id=projects/mh-api-389212/serviceAccounts/terraform@mh-api-389212.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/650836814988/locations/global/workloadIdentityPools/terraform-pool/attribute.repository/o-ga09/MH-API]
google_iam_workload_identity_pool_provider.terraform-provider: Refreshing state... [id=projects/mh-api-389212/locations/global/workloadIdentityPools/terraform-pool/providers/terraform-provider]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_cloud_run_service.stg-mh-api is tainted, so must be replaced
-/+ resource "google_cloud_run_service" "stg-mh-api" {
      ~ id                         = "locations/asia-northeast1/namespaces/mh-api-389212/services/stg-mh-api" -> (known after apply)
        name                       = "stg-mh-api"
      ~ status                     = [
          - {
              - conditions                   = [
                  - {
                      - message = "Revision 'stg-mh-api-00001-sxt' is not ready and cannot serve traffic. Image 'asia-northeast1-docker.pkg.dev/mh-api-389212/mh-api-389212/mh-api:ddb1fe8a5a3062e97621f24a93ffa9afbe4284d3' not found."
                      - reason  = "RevisionFailed"
                      - status  = "False"
                      - type    = "Ready"
                    },
                  - {
                      - message = "Image 'asia-northeast1-docker.pkg.dev/mh-api-389212/mh-api-389212/mh-api:ddb1fe8a5a3062e97621f24a93ffa9afbe4284d3' not found."
                      - status  = "True"
                      - type    = "ConfigurationsReady"
                        # (1 unchanged attribute hidden)
                    },
                  - {
                      - message = "Revision 'stg-mh-api-00001-sxt' is not ready and cannot serve traffic. Image 'asia-northeast1-docker.pkg.dev/mh-api-389212/mh-api-389212/mh-api:ddb1fe8a5a3062e97621f24a93ffa9afbe4284d3' not found."
                      - reason  = "RevisionFailed"
                      - status  = "False"
                      - type    = "RoutesReady"
                    },
                ]
              - latest_created_revision_name = "stg-mh-api-00001-sxt"
              - observed_generation          = 1
              - traffic                      = []
                # (2 unchanged attributes hidden)
            },
        ] -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ metadata (known after apply)
      - metadata {
          - annotations           = {} -> null
          - effective_annotations = {
              - "run.googleapis.com/ingress"        = "all"
              - "run.googleapis.com/ingress-status" = "all"
              - "run.googleapis.com/operation-id"   = "018871a1-9c89-4883-baba-f4a6898ea714"
              - "run.googleapis.com/urls"           = jsonencode(
                    [
                      - "https://stg-mh-api-650836814988.asia-northeast1.run.app",
                    ]
                )
              - "serving.knative.dev/creator"       = "terraform@mh-api-389212.iam.gserviceaccount.com"
              - "serving.knative.dev/lastModifier"  = "terraform@mh-api-389212.iam.gserviceaccount.com"
            } -> null
          - effective_labels      = {
              - "cloud.googleapis.com/location" = "asia-northeast1"
            } -> null
          - generation            = 1 -> null
          - labels                = {} -> null
          - namespace             = "mh-api-389212" -> null
          - resource_version      = "AAY2XNTie34" -> null
          - self_link             = "/apis/serving.knative.dev/v1/namespaces/650836814988/services/stg-mh-api" -> null
          - terraform_labels      = {} -> null
          - uid                   = "7566a445-1416-4d37-b2a3-8baf5de87cc8" -> null
        }

      ~ template {
          ~ metadata {
              ~ generation       = 0 -> (known after apply)
              ~ labels           = {
                  - "run.googleapis.com/startupProbeType" = "Default"
                } -> (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
                # (1 unchanged attribute hidden)
            }
          ~ spec {
              - node_selector         = {} -> null
              + serving_state         = (known after apply)
              ~ timeout_seconds       = 300 -> (known after apply)
                # (2 unchanged attributes hidden)

              ~ containers {
                  - args        = [] -> null
                  - command     = [] -> null
                  ~ image       = "asia-northeast1-docker.pkg.dev/mh-api-389212/mh-api-389212/mh-api:ddb1fe8a5a3062e97621f24a93ffa9afbe4284d3" -> "asia-northeast1-docker.pkg.dev/mh-api-389212/mh-api/mh-api:73add2df6156219aa56e97b1d216b089e893bacc"
                  + name        = (known after apply)
                    # (1 unchanged attribute hidden)

                  ~ resources (known after apply)
                  - resources {
                      - limits   = {
                          - "cpu"    = "1000m"
                          - "memory" = "512Mi"
                        } -> null
                      - requests = {} -> null
                    }

                    # (9 unchanged blocks hidden)
                }
            }
        }

      ~ traffic {
          + url             = (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # google_cloud_run_service.stg-mh-mcp is tainted, so must be replaced
-/+ resource "google_cloud_run_service" "stg-mh-mcp" {
      ~ id                         = "locations/asia-northeast1/namespaces/mh-api-389212/services/stg-mh-mcp" -> (known after apply)
        name                       = "stg-mh-mcp"
      ~ status                     = [
          - {
              - conditions                   = [
                  - {
                      - message = "Revision 'stg-mh-mcp-00001-4ds' is not ready and cannot serve traffic. Image 'asia-northeast1-docker.pkg.dev/mh-api-389212/mh-api-389212/mh-mcp:ddb1fe8a5a3062e97621f24a93ffa9afbe4284d3' not found."
                      - reason  = "RevisionFailed"
                      - status  = "False"
                      - type    = "Ready"
                    },
                  - {
                      - message = "Image 'asia-northeast1-docker.pkg.dev/mh-api-389212/mh-api-389212/mh-mcp:ddb1fe8a5a3062e97621f24a93ffa9afbe4284d3' not found."
                      - status  = "True"
                      - type    = "ConfigurationsReady"
                        # (1 unchanged attribute hidden)
                    },
                  - {
                      - message = "Revision 'stg-mh-mcp-00001-4ds' is not ready and cannot serve traffic. Image 'asia-northeast1-docker.pkg.dev/mh-api-389212/mh-api-389212/mh-mcp:ddb1fe8a5a3062e97621f24a93ffa9afbe4284d3' not found."
                      - reason  = "RevisionFailed"
                      - status  = "False"
                      - type    = "RoutesReady"
                    },
                ]
              - latest_created_revision_name = "stg-mh-mcp-00001-4ds"
              - observed_generation          = 1
              - traffic                      = []
                # (2 unchanged attributes hidden)
            },
        ] -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ metadata (known after apply)
      - metadata {
          - annotations           = {} -> null
          - effective_annotations = {
              - "run.googleapis.com/ingress"        = "all"
              - "run.googleapis.com/ingress-status" = "all"
              - "run.googleapis.com/operation-id"   = "c3f5bfa9-7c56-4552-b190-1b55a29b1e30"
              - "run.googleapis.com/urls"           = jsonencode(
                    [
                      - "https://stg-mh-mcp-650836814988.asia-northeast1.run.app",
                    ]
                )
              - "serving.knative.dev/creator"       = "terraform@mh-api-389212.iam.gserviceaccount.com"
              - "serving.knative.dev/lastModifier"  = "terraform@mh-api-389212.iam.gserviceaccount.com"
            } -> null
          - effective_labels      = {
              - "cloud.googleapis.com/location" = "asia-northeast1"
            } -> null
          - generation            = 1 -> null
          - labels                = {} -> null
          - namespace             = "mh-api-389212" -> null
          - resource_version      = "AAY2XNUNxK8" -> null
          - self_link             = "/apis/serving.knative.dev/v1/namespaces/650836814988/services/stg-mh-mcp" -> null
          - terraform_labels      = {} -> null
          - uid                   = "73fa01f4-f2b1-4acb-96b3-35ba4392c362" -> null
        }

      ~ template {
          ~ metadata {
              ~ generation       = 0 -> (known after apply)
              ~ labels           = {
                  - "run.googleapis.com/startupProbeType" = "Default"
                } -> (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
                # (1 unchanged attribute hidden)
            }
          ~ spec {
              - node_selector         = {} -> null
              + serving_state         = (known after apply)
              ~ timeout_seconds       = 300 -> (known after apply)
                # (2 unchanged attributes hidden)

              ~ containers {
                  - args        = [] -> null
                  - command     = [] -> null
                  ~ image       = "asia-northeast1-docker.pkg.dev/mh-api-389212/mh-api-389212/mh-mcp:ddb1fe8a5a3062e97621f24a93ffa9afbe4284d3" -> "asia-northeast1-docker.pkg.dev/mh-api-389212/mh-api/mh-mcp:73add2df6156219aa56e97b1d216b089e893bacc"
                  + name        = (known after apply)
                    # (1 unchanged attribute hidden)

                  ~ resources (known after apply)
                  - resources {
                      - limits   = {
                          - "cpu"    = "1000m"
                          - "memory" = "512Mi"
                        } -> null
                      - requests = {} -> null
                    }

                    # (9 unchanged blocks hidden)
                }
            }
        }

      ~ traffic {
          + url             = (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # google_cloud_run_service_iam_policy.auth will be created
  + resource "google_cloud_run_service_iam_policy" "auth" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "asia-northeast1"
      + policy_data = jsonencode(
            {
              + bindings = [
                  + {
                      + members = [
                          + "allUsers",
                        ]
                      + role    = "roles/run.invoker"
                    },
                ]
            }
        )
      + project     = "mh-api-389212"
      + service     = "stg-mh-api"
    }

  # google_cloud_run_service_iam_policy.mcp_auth will be created
  + resource "google_cloud_run_service_iam_policy" "mcp_auth" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "asia-northeast1"
      + policy_data = jsonencode(
            {
              + bindings = [
                  + {
                      + members = [
                          + "allUsers",
                          + "serviceAccount:terraform@mh-api-389212.iam.gserviceaccount.com",
                        ]
                      + role    = "roles/run.invoker"
                    },
                ]
            }
        )
      + project     = "mh-api-389212"
      + service     = "stg-mh-mcp"
    }

Plan: 4 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @o-ga09, Action: `pull_request`, Working Directory: ``, Workflow: `terraform`*